export type Nickname = {
    id: string
    nickname: string
}

function ofData(id: string, nickname: string){
    return {
        id: id,
        nickname: nickname
    }
}

export const nicknames = [
    ofData("0", "!70пп помойка"),
    ofData("623818798155431938", "типа осер"),
    ofData("428092030867079168", "6 digit hyilo"),
    ofData("943742708453867570", "учусь играть"),
    ofData("852584479493980180", "Химера!?"),
    ofData("775288226646720512", "osu!ждаю 2007"),
    ofData("285042291109003264", "дайте реквесты"),
    ofData("830405950363533355", "осу хуета"),
    ofData("583728824672321538", "0pp v osu"),
    ofData("482881435795980288", "ничего не сыграна osu"),
    ofData("715659920539648123", "без вутинга"),
    ofData("420986387861471233", "tabletenjoyer"),
    ofData("159706429245095936", "осер и битмарь"),
    ofData("695928502632972289", "просто играю в осу"),
    ofData("897935682914361355", "подвальный мирами"),
    ofData("268752193354465280", "ценитель фонка Elwand"),
    ofData("478752139699552268", "noob v osu"),
    ofData("715943616849248279", "клавиатурный насильник"),
    ofData("420986387861471233", "rx player"),
    ofData("695928502632972289", "учусь играть в осу с RX)"),
    ofData("716976820846592011", "999999999999pp"),
    ofData("852584479493980180", "OSU МОЯ ЖИЗНЬ"),
    ofData("981345633308921886", "go multi 1v1"),
    ofData("790756038973849610", "# 500пп #какжать180"),
    ofData("488995663795978241", "# КАК ИГРАТЬ ДТ ТАП ИКСОМ"),
    ofData("967852343230079117", "worst ru player"),
    ofData("473174801696161822", "osu_0pp"),
    ofData("341660045152354305", "249 pp uznik"),
    ofData("489065309819502592", "научите жать"),
    ofData("489065309819502592", "научите фингерконтролю"),
    ofData("795959175967801355", "а можно не чоукать"),
    ofData("540532862571773952", "727"),
    ofData("486796385455177748", "хассанище trying diffrent area's")
]

nicknames.sort((x, y) => Number(x.id) - Number(y.id))